Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GTM_TOM_3_Phase_Inverter_PWM_2/Libraries/iLLD/TC3xx/Tricore/_Impl/IfxSmu_cfg_TC33x.h
    IfxSmu_Alarm_SMU_Timer1_TimeOut                                       = 337, /**< \brief ALM10[17] : Safety Mechanism: Recovery Timer 1  Alarm: Timer time-out */
    IfxSmu_Alarm_SMU_Error_PinFaultStateActivation                        = 338, /**< \brief ALM10[18] : Safety Mechanism: ErrorPin Alarm: Error Pin fault state activation*/
    IfxSmu_Alarm_SMU_Safety_FfCorrectableErrorDetected                    = 340, /**< \brief ALM10[20] : Safety Mechanism: Safety FlipFlop Alarm: Safety FF correctable error detected*/
    IfxSmu_Alarm_SMU_Safety_FfUncorrectableErrorDetected                  = 341, /**< \brief ALM10[21] : Safety Mechanism: Safety FlipFlop Alarm: Safety FF uncorrectable error detected*/
    IfxSmu_Alarm_SMU_Access_EnableErrorDetected                           = 342, /**< \brief ALM10[22] : Safety Mechanism: Access Enable Protection Alarm: Access Enable error detected*/
    IfxSmu_Alarm_LMU_EDC_AddressPhaseError                                = 352, /**< \brief ALM11[0] : Safety Mechanism: SRI Error Detection Code (EDC) Alarm: EDC Address Phase Error*/
    IfxSmu_Alarm_LMU_EDC_WritePhaseError                                  = 353, /**< \brief ALM11[1] : Safety Mechanism: SRI Error Detection Code (EDC) Alarm: EDC Write Phase Error*/
    IfxSmu_Alarm_XBAR_EDC_AddressPhaseError                               = 354, /**< \brief ALM11[2] : Safety Mechanism: SRI Error Detection Code (EDC) Alarm: EDC Address Phase Error*/
    IfxSmu_Alarm_XBAR_EDC_WritePhaseError                                 = 355, /**< \brief ALM11[3] : Safety Mechanism: SRI Error Detection Code (EDC) Alarm: EDC Write Phase Error*/
    IfxSmu_Alarm_DMU_EDC_AddressPhaseError                                = 356, /**< \brief ALM11[4] : Safety Mechanism: SRI Error Detection Code (EDC) Alarm: EDC Address Phase Error*/
    IfxSmu_Alarm_DMU_EDC_WritePhaseError                                  = 357, /**< \brief ALM11[5] : Safety Mechanism: SRI Error Detection Code (EDC) Alarm: EDC Write Phase Error*/
    IfxSmu_Alarm_SFI_BBB_EDC_AddressPhaseError                            = 358, /**< \brief ALM11[6] : Safety Mechanism: SRI Error Detection Code (EDC) Alarm: EDC Address Phase Error*/
    IfxSmu_Alarm_SFI_BBB_EDC_WritePhaseError                              = 359, /**< \brief ALM11[7] : Safety Mechanism: SRI Error Detection Code (EDC) Alarm: EDC Write Phase Error*/
    IfxSmu_Alarm_SRI_EDC_ReadPhaseError                                  = 360, /**< \brief ALM11[8] : Safety Mechanism: SRI Error Detection Code (EDC)  Alarm: EDC Read Phase Error */
    IfxSmu_Alarm_SFI_SPB_EDC_ReadPhaseError                               = 361, /**< \brief ALM11[9] : Safety Mechanism: SRI Error Detection Code (EDC) Alarm: EDC Read Phase Error*/
    IfxSmu_Alarm_CONVERTER_Phase_SyncronizerError                         = 364, /**< \brief ALM11[12] : Safety Mechanism: Converter Alarm: Phase Syncronizer Error*/
    IfxSmu_Alarm_XBAR_SOTA_SwapError                                      = 365, /**< \brief ALM11[13] : Safety Mechanism: SRI SOTA Monitor Alarm: SOTA Swap Error*/
} IfxSmu_Alarm;

/******************************************************************************/
/*-----------------------------Data Structures--------------------------------*/
/******************************************************************************/

#endif /* IFXSMU_CFG_TC33X_H */
